from prompt import string  # Импортируем prompt для ввода строк

def welcome():
    print("Первая попытка запустить проект!")
    print("\n***")
    
    # Бесконечный цикл для постоянного запроса команд
    while True:
        print("<command> exit - выйти из программы")
        print("<command> help - справочная информация")
        
        # Запрашиваем ввод у пользователя (в консоли это будет выглядеть как 'Введите команду: ')
        command = string("Введите команду: ")
        
        if command == "exit":
            break  # Выходим из цикла и завершаем программу
        elif command == "help":
            # Если ввели help, цикл просто пойдет на следующий круг и снова напечатает справку
            continue 
        else:
            print("Неизвестная команда. Попробуйте еще раз.")
